In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
df = pd.read_csv('./Advertising.csv')

In [9]:
df.head(5)

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [10]:
df.tail(5)

     Unnamed: 0     TV  Radio  Newspaper  Sales
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

In [11]:
df.columns

Index(['Unnamed: 0', 'TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [12]:
df.tail(3)

     Unnamed: 0     TV  Radio  Newspaper  Sales
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [16]:
df.dtypes

Unnamed: 0      int64
TV            float64
Radio         float64
Newspaper     float64
Sales         float64
dtype: object

In [17]:
df.isna().sum()

Unnamed: 0    0
TV            0
Radio         0
Newspaper     0
Sales         0
dtype: int64

In [21]:
df1 = df.drop('Radio',axis=1)
df1.head(10)

   Unnamed: 0     TV  Newspaper  Sales
0           1  230.1       69.2   22.1
1           2   44.5       45.1   10.4
2           3   17.2       69.3    9.3
3           4  151.5       58.5   18.5
4           5  180.8       58.4   12.9
5           6    8.7       75.0    7.2
6           7   57.5       23.5   11.8
7           8  120.2       11.6   13.2
8           9    8.6        1.0    4.8
9          10  199.8       21.2   10.6

In [22]:
df['updated_sales'] = df['Sales'] * 1.1

In [23]:
df.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales  updated_sales
0           1  230.1   37.8       69.2   22.1          24.31
1           2   44.5   39.3       45.1   10.4          11.44
2           3   17.2   45.9       69.3    9.3          10.23
3           4  151.5   41.3       58.5   18.5          20.35
4           5  180.8   10.8       58.4   12.9          14.19

In [24]:
df.shape

(200, 6)

In [25]:
df.describe

<bound method NDFrame.describe of      Unnamed: 0     TV  Radio  Newspaper  Sales  updated_sales
0             1  230.1   37.8       69.2   22.1          24.31
1             2   44.5   39.3       45.1   10.4          11.44
2             3   17.2   45.9       69.3    9.3          10.23
3             4  151.5   41.3       58.5   18.5          20.35
4             5  180.8   10.8       58.4   12.9          14.19
..          ...    ...    ...        ...    ...            ...
195         196   38.2    3.7       13.8    7.6           8.36
196         197   94.2    4.9        8.1    9.7          10.67
197         198  177.0    9.3        6.4   12.8          14.08
198         199  283.6   42.0       66.2   25.5          28.05
199         200  232.1    8.6        8.7   13.4          14.74

[200 rows x 6 columns]>

In [26]:
df.describe()

,Unnamed: 0,TV,Radio,Newspaper,Sales,updated_sales
count,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
mean,100.500000,147.042500,23.264000,30.554000,14.022500,15.424750
std,57.879185,85.854236,14.846809,21.778621,5.217457,5.739202
min,1.000000,0.700000,0.000000,0.300000,1.600000,1.760000
25%,50.750000,74.375000,9.975000,12.750000,10.375000,11.412500
50%,100.500000,149.750000,22.900000,25.750000,12.900000,14.190000
75%,150.250000,218.825000,36.525000,45.100000,17.400000,19.140000
max,200.000000,296.400000,49.600000,114.000000,27.000000,29.700000